u5197140705-commits/dbus_porting_BA/app/variant_stm32g071/prog/MSP/stm32g0/IntTbl.c
#elif defined(STM32G081)
   WWDG_IRQHandler                  ,     //  0               7                 0x0040
   PVD_IRQHandler                   ,     //  1               8                 0x0044
   RTC_IRQHandler                   ,     //  2               9                 0x0048
   FLASH_IRQHandler                 ,     //  3              10                 0x004C
   RCC_IRQHandler                   ,     //  4              11                 0x0050
   EXTI0_1_IRQHandler               ,     //  5              12                 0x0054
   EXTI2_3_IRQHandler               ,     //  6              13                 0x0058
   EXTI4_15_IRQHandler              ,     //  7              14                 0x005C
   USBPD1_USBPD2_IRQHandler         ,     //  8              15                 0x0060
   DMA_Channel1_IRQHandler          ,     //  9              16                 0x0064
   DMA_Channel2_3_IRQHandler        ,     // 10              17                 0x0068
   DMA_Channel4_5_6_7_IRQHandler    ,     // 11              18                 0x006C
   ADC_COMP_IRQHandler              ,     // 12              19                 0x0070
   TIM1_BRK_UP_TRG_COMP_IRQHandler  ,     // 13              20                 0x0074
   TIM1_CC_IRQHandler               ,     // 14              21                 0x0078
   TIM2_IRQHandler                  ,     // 15              22                 0x007C
   TIM3_IRQHandler                  ,     // 16              23                 0x0080
   TIM6_DAC_LPTIM1_IRQHandler       ,     // 17              24                 0x0084
   TIM7_LPTIM2_IRQHandler           ,     // 18              25                 0x0088
   TIM14_IRQHandler                 ,     // 19              26                 0x008C
   TIM15_IRQHandler                 ,     // 20              27                 0x0090
   TIM16_IRQHandler                 ,     // 21              28                 0x0094
   TIM17_IRQHandler                 ,     // 22              29                 0x0098
   I2C1_IRQHandler                  ,     // 23              30                 0x009C
   I2C2_IRQHandler                  ,     // 24              31                 0x00A0
   SPI1_IRQHandler                  ,     // 25              32                 0x00A4
   SPI2_IRQHandler                  ,     // 26              33                 0x00A8
   USART1_IRQHandler                ,     // 27              34                 0x00AC
   USART2_IRQHandler                ,     // 28              35                 0x00B0
   USART3_USART4_LPUART1_IRQHandler ,     // 29              36                 0x00B4
   CEC_IRQHandler                   ,     // 30              37                 0x00B8
   AES_RNG_IRQHandler               ,     // 31              38                 0x00BC

#else
#endif
};
SDEF_SetSegmentConst_Default()

/* Function's task is to set the interrupt priorities according to the user's needs, different from the default settings.
 * If necessary, uncomment the relevant lines and set the required interrupt priorities
 */
void ITBL_setCustomInterruptPriority(void)
{
    /* Cortex-M0+ settable interrupts */
    //NVIC_SetPriority(SVC_IRQn, PRIORITY_HIGH);
    //NVIC_SetPriority(PendSV_IRQn, PRIORITY_HIGH);
    //NVIC_SetPriority(SysTick_IRQn, PRIORITY_HIGH);
    /* Peripheral interrupts */
#if defined(STM32G030)
    //NVIC_SetPriority(WWDG_IRQn, PRIORITY_MEDIUM);
    //NVIC_SetPriority(RTC_TAMP_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(FLASH_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(RCC_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(EXTI0_1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(EXTI2_3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(EXTI4_15_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(DMA_Channel1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(DMA_Channel2_3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(DMA_Channel4_5_6_7_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(ADC_COMP_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM1_BRK_UP_TRG_COMP_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM1_CC_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM14_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM16_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM17_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(I2C1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(I2C2_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(SPI1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(SPI2_SPI3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(USART1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(USART2_IRQn, PRIORITY_LOW);
#elif defined(STM32G0B0)
    //NVIC_SetPriority(WWDG_IRQn, PRIORITY_MEDIUM);
    //NVIC_SetPriority(RTC_TAMP_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(FLASH_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(RCC_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(EXTI0_1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(EXTI2_3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(EXTI4_15_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(USB_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(DMA1_Channel1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(DMA1_Channel2_3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(DMA1_Channel4_5_6_7_DMAMUX_DMA2_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(ADC_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM1_BRK_UP_TRG_COMP_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM1_CC_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM3_TIM4_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM6_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM7_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM14_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM15_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM16_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM17_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(I2C1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(I2C2_I2C3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(SPI1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(SPI2_SPI3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(USART1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(USART2_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(USART3_USART4_USART5_USART6_IRQn, PRIORITY_LOW);
#elif defined(STM32G031)
    //NVIC_SetPriority(WWDG_IRQn, PRIORITY_MEDIUM);
    //NVIC_SetPriority(PVD_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(RTC_TAMP_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(FLASH_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(RCC_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(EXTI0_1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(EXTI2_3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(EXTI4_15_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(DMA_Channel1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(DMA_Channel2_3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(DMA_Channel4_5_6_7_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(ADC_COMP_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM1_BRK_UP_TRG_COMP_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM1_CC_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM2_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM14_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM16_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM17_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(I2C1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(I2C2_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(SPI1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(SPI2_SPI3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(USART1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(USART2_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(USART3_USART4_LPUART1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(CEC_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(AES_RNG_IRQn, PRIORITY_LOW);
#elif defined(STM32G051)
    //NVIC_SetPriority(WWDG_IRQn, PRIORITY_MEDIUM);
    //NVIC_SetPriority(PVD_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(RTC_STAMP_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(FLASH_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(RCC_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(EXTI0_1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(EXTI2_3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(EXTI4_15_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(DMA_Channel1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(DMA_Channel2_3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(DMA_Channel4_5_6_7_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(ADC_COMP_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM1_BRK_UP_TRG_COMP_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM1_CC_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM2_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM6_DAC_LPTIM1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM7_LPTIM2_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM14_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM15_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM16_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM17_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(I2C1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(I2C2_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(SPI1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(SPI2_SPI3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(USART1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(USART2_IRQn, PRIORITY_LOW);
#elif defined(STM32G071)
    //NVIC_SetPriority(WWDG_IRQn, PRIORITY_MEDIUM);
    //NVIC_SetPriority(PVD_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(RTC_STAMP_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(FLASH_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(RCC_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(EXTI0_1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(EXTI2_3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(EXTI4_15_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(UCPD1_UCPD2_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(DMA_Channel1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(DMA_Channel2_3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(DMA_Channel4_5_6_7_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(ADC_COMP_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM1_BRK_UP_TRG_COMP_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM1_CC_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM2_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM6_DAC_LPTIM1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM7_LPTIM2_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM14_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM15_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM16_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM17_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(I2C1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(I2C2_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(SPI1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(SPI2_SPI3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(USART1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(USART2_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(USART3_USART4_LPUART1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(CEC_IRQn, PRIORITY_LOW);
#elif defined(STM32G0B1) || defined(STM32G0C1)
    //NVIC_SetPriority(WWDG_IRQn, PRIORITY_MEDIUM);
    //NVIC_SetPriority(PVD_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(RTC_TAMP_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(FLASH_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(RCC_CRS_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(EXTI0_1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(EXTI2_3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(EXTI4_15_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(USBPD1_USBPD2_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(DMA1_Channel1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(DMA1_Channel2_3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(DMA1_Channel4_5_6_7_DMAMUX_DMA2_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(ADC_COMP_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM1_BRK_UP_TRG_COMP_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM1_CC_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM2_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM3_TIM4_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM6_DAC_LPTIM1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM7_LPTIM2_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM14_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM15_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM16_FDCAN_IT0_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM17_FDCAN_IT1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(I2C1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(I2C2_I2C3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(SPI1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(SPI2_SPI3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(USART1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(USART2_LPUART2_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(USART3_USART4_USART5_USART6_LPUART1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(CEC_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(AES_RNG_IRQn, PRIORITY_LOW);
#elif defined(STM32G081)
    //NVIC_SetPriority(WWDG_IRQn, PRIORITY_MEDIUM);
    //NVIC_SetPriority(PVD_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(RTC_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(FLASH_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(RCC_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(EXTI0_1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(EXTI2_3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(EXTI4_15_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(USBPD1_USBPD2_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(DMA_Channel1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(DMA_Channel2_3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(DMA_Channel4_5_6_7_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(ADC_COMP_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM1_BRK_UP_TRG_COMP_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM1_CC_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM2_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM6_DAC_LPTIM1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM7_LPTIM2_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM14_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM15_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM16_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(TIM17_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(I2C1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(I2C2_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(SPI1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(SPI2_SPI3_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(USART1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(USART2_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(USART3_USART4_LPUART1_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(CEC_IRQn, PRIORITY_LOW);
    //NVIC_SetPriority(AES_RNG_IRQn, PRIORITY_LOW);
#endif
}
